[{
  "title": "Night of the Day of the Dawn of the Son of the Bride of the Return of the Revenge of the Terror of the Attack of the Evil, Mutant, Hellbound, Flesh-Eating Subhumanoid Zombified Living Dead, Part 2: In Shocking 2-D",
  "genre": "Comedy,Horror",
  "description": "The movie title explains a lot.",
  "rating": 4.4
},{
  "title": "Indiana Jones and the Kingdom of the Crystal Skull",
  "genre": "Action/Adventure",
  "description": "It's the height of the Cold War, and famous archaeologist Indiana Jones (Harrison Ford), returning from his latest adventure, finds out his job at Marshall College is in jeopardy. He meets Mutt (Shia La Beouf), a young man who wants Indy to help him find the legendary Crystal Skull of Akator, and the pair set out for Peru. However, deadly agent Irina Spalko (Cate Blanchett) is searching for the powerful artifact, too, because the Soviets believe it can help them conquer the world.",
  "rating": 7.5
},{
  "title": "Encanto",
  "genre": "Musical/Comedy",
  "description": "The Madrigals are an extraordinary family who live hidden in the mountains of Colombia in a charmed place called the Encanto. The magic of the Encanto has blessed every child in the family with a unique gift -- every child except Mirabel. However, she soon may be the Madrigals last hope when she discovers that the magic surrounding the Encanto is now in danger.",
  "rating": 7.2
},{
  "title": "Inception",
  "genre": "Science fiction/Thriller",
  "description": "Dom Cobb (Leonardo DiCaprio) is a thief with the rare ability to enter people's dreams and steal their secrets from their subconscious. His skill has made him a hot commodity in the world of corporate espionage but has also cost him everything he loves. Cobb gets a chance at redemption when he is offered a seemingly impossible task: Plant an idea in someone's mind. If he succeeds, it will be the perfect crime, but a dangerous enemy anticipates Cobb's every move.",
  "rating": 8.8
},{
  "title": "PHFFFT",
  "genre": "Rom-Com",
  "description": "After eight years of staying together, Robert and Nina's marriage ends in divorce. However, despite choosing separate paths, destiny brings them together on several instances.",
  "rating": 6.6
},{
  "title": "Avatar The Way of Water",
  "genre": " Sci-fi/Adventure",
  "description": "Jake Sully and Ney'tiri have formed a family and are doing everything to stay together. However, they must leave their home and explore the regions of Pandora. When an ancient threat resurfaces, Jake must fight a difficult war against the humans.",
  "rating": 7.7
},{
  "title": "Overflow",
  "genre": "Hentai",
  "description": "THe Story of a boy who lives with his cousins and they are going through a tough time,but things change and it gets intense.",
  "rating": 6.8
},{
  "title": "Friends with Benefits",
  "genre": "Rom-Com",
  "description": "The plot revolves around Dylan Harper (Timberlake) and Jamie Rellis (Kunis), who meet in New York City, and naively believe adding intimacy to their friendship will not lead to complications. Over time, they begin to develop deep feelings for each other, only to deny it each time they are together.",
  "rating": 6.5
},{
  "title": "Kimi no Na Wa(Your Name)",
  "genre": " Anime/Romance",
  "description": "Two teenagers share a profound, magical connection upon discovering they are swapping bodies. Things manage to become even more complicated when the boy and girl decide to meet in person.",
  "rating": 8.4
},{
  "title": "Avengers EndGame",
  "genre": "Action,Superhero",
  "description": "The grave course of events set in motion by Thanos that wiped out half the universe and fractured the Avengers ranks compels the remaining Avengers to take one final stand in Marvel Studios' grand conclusion to twenty-two films, Avengers: Endgame.",
  "rating": 8.4
},{
  "title": "Everything Everywhere All at Once",
  "genre": " Sci-fi/Adventure",
  "description": "When an interdimensional rupture unravels reality, an unlikely hero must channel her newfound powers to fight bizarre and bewildering dangers from the multiverse as the fate of the world hangs in the balance.",
  "rating": 7.9
},{
  "title": "Radhe",
  "genre": " Action/Thriller",
  "description": "After taking the dreaded gangster Gani Bhai, ACP Rajveer Shikawat, as known as Radhe, goes on a manhunt to find the wealthiest man of the town secretly running a crime syndicate.",
  "rating": 1.9
},{
  "title": "Interstellar",
  "genre": " Sci-fi/Adventure",
  "description": "n Earth's future, a global crop blight and second Dust Bowl are slowly rendering the planet uninhabitable. Professor Brand (Michael Caine), a brilliant NASA physicist, is working on plans to save mankind by transporting Earth's population to a new home via a wormhole. But first, Brand must send former NASA pilot Cooper (Matthew McConaughey) and a team of researchers through the wormhole and across the galaxy to find out which of three planets could be mankind's new home.",
  "rating": 8.6
},{
  "title": "Pushpa",
  "genre": " Action/Thriller",
  "description": "A labourer named Pushpa makes enemies as he rises in the world of red sandalwood smuggling. However, violence erupts when the police attempt to bring down his illegal business.",
  "rating": 7
},{
  "title": "Independece Day(1996)",
  "genre": " Sci-fi/Action",
  "description": "In the epic adventure film `Independence Day,' strange phenomena surface around the globe. The skies ignite. Terror races through the world's major cities. As these extraordinary events unfold, it becomes increasingly clear that a force of incredible magnitude has arrived. Its mission: total annihilation over the Fourth of July weekend. The last hope to stop the destruction is an unlikely group of people united by fate and unimaginable circumstances.",
  "rating": 6
},{
  "title": "Pathaan",
  "genre": " Action/Thriller",
  "description": "An Indian spy battles against the leader of a gang of mercenaries who have a heinous plot for his homeland.",
  "rating": 4.9
},{
  "title": "Parasite",
  "genre": " Thriller/Drama",
  "description": "The struggling Kim family sees an opportunity when the son starts working for the wealthy Park family. Soon, all of them find a way to work within the same household and start living a parasitic life.",
  "rating": 8.5
},{
  "title": "Nope",
  "genre": " Horror/Thriller",
  "description": "A man and his sister discover something sinister in the skies above their California horse ranch, while the owner of a nearby theme park tries to profit from the mysterious, otherworldly phenomenon.",
  "rating": 6.8
},{
  "title": "The Lion King 1994",
  "genre": " Musical/Family",
  "description": "The adventures of the young lion Simba, the heir of his father, Mufasa. Simba's wicked uncle, Scar, plots to usurp Mufasa's throne by luring father and son into a stampede of wildebeests. But Simba escapes, and only Mufasa is killed. Simba returns as an adult to take back his homeland from Scar with the help of his friends Timon and Pumbaa.",
  "rating": 8.5
},{
  "title": "Shutter Island",
  "genre": " Thriller/Mystery",
  "description": "The implausible escape of a brilliant murderess brings U.S. Marshal Teddy Daniels and his new partner to Ashecliffe Hospital, a fortress-like insane asylum located on a remote, windswept island. The woman appears to have vanished from a locked room, and there are hints of terrible deeds committed within the hospital walls. As the investigation deepens, Teddy realizes he will have to confront his own dark fears if he hopes to make it off the island alive.",
  "rating": 8.2
}]